/**
 * \file
 * \brief Взаимодействие с пользователем
 * \details  Сканирование кнопок и управление звуком.
 *
 * \date создан 13.11.2018
 * \author Nick Egorrov
 */

#include "user.h"

/*************************************************************
 *      Variable in RAM
 *************************************************************/

static key_t key = VK_NO;

/*************************************************************
 *      Private function prototype.
 *************************************************************/

/*************************************************************
 *      Public function
 *************************************************************/

extern void user_init()
{

}

extern void user_scan_key()
{

}

extern key_t user_get_key()
{
        key_t retval = key;
        key = VK_NO;
        return retval;
}

/*************************************************************
 *      Private function.
 *************************************************************/

